# -*- coding: utf-8 -*-

import fixed_size_text as ft

nu = ft.Num()
it = ft.Int()
ymd = ft.DatYYYMMDD()

ah1 = [ft.col(8),  # Ονομα Αρχείου
       ft.col(8, 0, ' ', ymd),  # Ημερομηνία δημιουργίας
       ft.col(4),  # Αρ.Κύκλου τρεξίματος
       ft.col(127)  # Filler
       ]
h1 = ft.row(0, ah1)

ah2 = [ft.col(4),  # Έτος
       ft.col(18),  # Επώνυμο
       ft.col(9),  # Όνομα
       ft.col(3),  # Πατρώνυμο
       ft.col(1),  # 0=Επωνυμία, 1=Ονοματεπώνυμο
       ft.col(9),  # ΑΦΜ
       ft.col(16),  # Αντικείμενο Δραστηριότητας
       ft.col(10),  # Πόλη
       ft.col(16),  # Οδός
       ft.col(5),  # Αριθμός
       ft.col(5),  # Τ.Κ.
       ft.col(51)  # Filler
       ]
h2 = ft.row(1, ah2)

ah3 = [ft.col(16, 1, '0', nu),  # Ακαθάριστες αποδοχές
       ft.col(16, 1, '0', nu),  # Κρατήσεις
       ft.col(16, 1, '0', nu),  # Καθαρές Αποδοχές
       ft.col(15, 1, '0', nu),  # Φόρος που αναλογεί
       ft.col(15, 1, '0', nu),  # Φόρος που παρακρατήθηκε
       ft.col(15, 1, '0', nu),  # Ειδική Εισφορά Αλληλεγγύης
       ft.col(14, 1, '0', nu),  # Χαρτόσημο
       ft.col(13, 1, '0', nu),  # ΟΓΑ Χαρτοσήμου
       ft.col(27)  # Filler
       ]
h3 = ft.row(2, ah3)

ah4 = [ft.col(9),  # ΑΦΜ εργαζομένου
       ft.col(1),  # Filler
       ft.col(18),  # Επώνυμο
       ft.col(9),  # Όνομα
       ft.col(3),  # Όνομα συζύγου ή πατέρα
       ft.col(11),  # ΑΜΚΑ
       ft.col(2, 1, '0', it),  # Αριθμός παιδιών
       ft.col(2),  # Είδος αποδοχών 01=Τακτικές αποδοχές
       ft.col(11, 1, '0', nu),  # Ακαθάριστες αποδοχές
       ft.col(10, 1, '0', nu),  # Κρατήσεις
       ft.col(11, 1, '0', nu),  # Καθαρές Αποδοχές
       ft.col(10, 1, '0', nu),  # Φόρος που αναλογεί
       ft.col(10, 1, '0', nu),  # Φόρος που παρακρατήθηκε
       ft.col(10, 1, '0', nu),  # Ειδική Εισφορά Αλληλεγγύης
       ft.col(9, 1, '0', nu),  # Χαρτόσημο
       ft.col(8, 1, '0', nu),  # ΟΓΑ Χαρτοσήμου
       ft.col(4, 1, '0', it),  # Έτος Αναφοράς για Αναδρομικές αποδ.
       ft.col(9),  # Filler
       ]
h4 = ft.row(3, ah4)


r1 = h1.write(['JL10', '2016-01-15', '2015', ''])

a2 = ['2015',
      u'ΑΚΤΗ ΦΑΡΑΓΓΑ ΠΑΡΟΥ ΕΠΕ',
      '',
      '',
      0,
      '999249820',
      u'ΕΣΤΙΑΤΟΡΙΟ ΜΠΑΡ',
      u'ΠΑΡΟΣ',
      u'ΑΓΑΘΗΜΕΡΟΥ',
      '3',
      '84400',
      ''
      ]
r2 = h2.write(a2)

a3 = [20220.98, 3575.14, 16645.84, 0, 0, 0, 0, 0, '']
r3 = h3.write(a3)

a4 = ['034140096', '', u'ΛΑΖΑΡΟΣ', u'ΘΕΟΔΩΡΟΣ', u'ΚΩΝΣΤΑΝΤ', '02108001427',
      1, '01',
      20220.98, 3575.14, 16645.84, 0, 0, 0, 0, 0, '', ''
      ]
r4 = h4.write(a4)

import sys
reload(sys)
sys.setdefaultencoding("utf-8")
rtel = r1 + r2 + r3 + r4
print(len(r1), len(r2), len(r3), len(r4))

f = open('tstfile', 'w')

f.write(rtel.encode('CP1253'))
f.close()
